---
title: "2023 AoC Day 10 – Pipe Maze"
date: 2023-12-10
tags:
  - raku
categories:
  - code
  - advent
comments: true
---

This is a solution to Advent of Code 2023 day 10, written in Raku.

<!--more-->

[[https://adventofcode.com/2023/day/10]]

** Part One

#+begin_quote
The pipes are arranged in a two-dimensional grid of tiles:

- ~|~ is a vertical pipe connecting north and south.
- ~-~ is a horizontal pipe connecting east and west.
- ~L~ is a 90-degree bend connecting north and east.
- ~J~ is a 90-degree bend connecting north and west.
- ~7~ is a 90-degree bend connecting south and west.
- ~F~ is a 90-degree bend connecting south and east.
- ~.~ is ground; there is no pipe in this tile.
- ~S~ is the starting position of the animal; there is a pipe on this tile, but your sketch
  doesn't show what shape the pipe has.

Based on the acoustics of the animal's scurrying, you're confident the pipe that contains the
animal is one large, continuous loop ...

Find the single giant loop starting at ~S~. How many steps along the loop does it take to get
from the starting position to the point farthest from the starting position?
#+end_quote

Strategy:

+ Parse the input into a 2 dimensional array
+ Use ~grep~ to find the ~S~ start location
+ Path walk using a ~given~ / ~when~ decision ladder

#+begin_src raku :results output
enum Direction <North East South West>;

my @input = '10-input.txt'.IO.lines>>.comb;
my $width = +@input[0];
my $height = +@input;

my @grid[$height;$width] = @input;
my ($start-y, $start-x) = @grid.kv.grep(-> @k, $v { $v eq 'S' })[0][0];
my $y = $start-y; my $x = $start-x;

my $dir = South;
my $length = 0;
my $done = False;
while !$done {
    $length += 1;
    given $dir {
        when North {
            $y -= 1;
            given @grid[$y;$x] {
                when '|' { }
                when '7' { $dir = West; }
                when 'F' { $dir = East; }
                when 'S' { $done = True; }
                default { say "Broken."; exit; }
            }
        }
        when South {
            $y += 1;
            given @grid[$y;$x] {
                when '|' { }
                when 'J' { $dir = West; }
                when 'L' { $dir = East; }
                when 'S' { $done = True; }
                default { say "Broken."; exit; }
            }
        }
        when East {
            $x += 1;
            given @grid[$y;$x] {
                when '-' { }
                when 'J' { $dir = North; }
                when '7' { $dir = South; }
                when 'S' { $done = True; }
                default { say "Broken."; exit; }
            }
        }
        when West {
            $x -= 1;
            given @grid[$y;$x] {
                when '-' { }
                when 'F' { $dir = South; }
                when 'L' { $dir = North; }
                when 'S' { $done = True; }
                default { say "Broken."; exit; }
            }
        }
    }
}

say "Steps to furthest {$length / 2}";
#+end_src

#+RESULTS:
: Steps to furthest 6907


